#+BEGIN_COMMENT
.. title: Nikola Set Up - Do it the Simple Way.
.. slug: nikola-set-up-do-it-the-simple-way
.. date: 2020-04-12 21:45:52 UTC+02:00
.. tags: blogging, emacs
.. category: 
.. link: 
.. description: 
.. type: text
.. has_math: yes
#+END_COMMENT

Nikola is a python package to automatically generate static
webpages. This is more secure than operating through dynamic websites
for non-expert users. Moreover the integration with org will allow you
to easily generate blogs based on your org documents and this will
prove to be especially useful given that you can work following your
literate programming workflow without bothering too much on the
format.

You can finally generate and publish interesting discoveries in an
instantaneous way.

{{{TEASER_END}}}

* Render LaTex

Just include the =.. has_math: yes= argument in your post arguments.

Then you can render LaTex code

#+BEGIN_src latex :results drawer :exports results
\[ Y_{ijk} = \mu + \alpha_i + \beta_j + \alpha \beta_{ij} + \epsilon_{ijk} \]
#+END_src

#+RESULTS:
:results:
\[ Y_{ijk} = \mu + \alpha_i + \beta_j + \alpha \beta_{ij} + \epsilon_{ijk} \]
:end:

